src/test/resources/customerenergyplantests/create-payment.json

{
    "lastUpdatedBy": "ATHENA_PORTAL",
    "createdBy": "ATHENA_PORTAL",
    "customerId": "1692718136-3e03-4617-adad-d790371ded1b",
    "offerId": 1010,
    "offerType": "energy_plan",
    "offerEmi": 0,
    "emiDate": "2023-10-18",
    "missedEmi": 0,
    "settlementAmount": 0,
    "status": "payment-paid",
    "locationCode": "KE",
    "currency": "XOF",
    "vehicleStatus": "energy_plan"
}
